/*
 * @Autor: XinWei
 * @Date: 2020-11-17 15:27:36
 * @LastEditors: XinWei
 * @LastEditTime: 2020-11-17 16:37:13
 * @Description: 城市索引
 */

 const citySource = {
   a:'阿拉善盟,鞍山市,安庆市,安阳市,阿坝藏族羌族自治州,安顺市,阿里地区,安康市,阿克苏地区,阿勒泰地区',
   b:'北京市,保定市,包头市,巴彦淖尔市,本溪市,白山市,白城市,蚌埠市,滨州市,北海市,百色市,巴中市,毕节市,保山市,宝鸡市,白银市,博尔塔拉蒙古自治州,巴音郭楞蒙古自治州',
   c:'承德市,沧州市,长治市,赤峰市,朝阳市,长春市,常州市,滁州市,池州市,长沙市,常德市,郴州市,潮州市,崇左市,成都市,楚雄彝族自治州,昌都市,昌吉回族自治州 ',
   d:'大同市,大连市,丹东市,大庆市,大兴安岭地区,东营市,德州市,东莞市,德阳市,达州市,大理白族自治州,德宏傣族景颇族自治州,迪庆藏族自治州,定西市 ',
   e:'鄂尔多斯市,鄂州市,恩施土家族苗族自治州',
   f:'抚顺市,阜新市,阜阳市,福州市,抚州市,佛山市,防城港市',
   g:'赣州市,广州市,桂林市,贵港市,广元市,广安市,甘孜藏族自治州,贵阳市,甘南藏族自治州,果洛藏族自治州,固原市',
   h:'邯郸市,衡水市,呼和浩特市,呼伦贝尔市,葫芦岛市,哈尔滨市,鹤岗市,黑河市,淮安市,杭州市,湖州市,合肥市,淮南市,淮北市,黄山市,菏泽市,鹤壁市,黄石市,黄冈市,衡阳市,怀化市,惠州市,河源市,贺州市,河池市,海口市,红河哈尼族彝族自治州,汉中市,海东市,海北藏族自治州,黄南藏族自治州,海南藏族自治州,海西蒙古族藏族自治州,哈密市,和田地区',
  //  i:'',
   j:'晋城市,晋中市,锦州市,吉林市,鸡西市,佳木斯市,嘉兴市,金华市,景德镇市,九江市,吉安市,济南市,济宁市,焦作市,荆门市,荆州市,江门市,揭阳市,嘉峪关市,金昌市,酒泉市',
   k:'开封市,昆明市,克拉玛依市,克孜勒苏柯尔克孜自治州,喀什地区',
   l:'廊坊市,临汾市,吕梁市,辽阳市,辽源市,连云港市,丽水市,六安市,龙岩市,临沂市,聊城市,洛阳市,娄底市,柳州市,来宾市,乐山市,凉山彝族自治州,六盘水市,丽江市,临沧市,拉萨市,林芝市,兰州市,陇南市,临夏回族自治州',
   m:'牡丹江市,马鞍山市,茂名市,梅州市,绵阳市,眉山市',
   n:'南京市,南通市,宁波市,南平市,宁德市,南昌市,南阳市,南宁市,内江市,南充市,怒江傈僳族自治州,那曲市',
  //  o:'',
   p:'盘锦市,莆田市,萍乡市,平顶山市,攀枝花市,普洱市,平凉市',
   q:'秦皇岛市,齐齐哈尔市,七台河市,泉州市,青岛市,清远市,钦州市,黔西南布依族苗族自治州,黔东南苗族侗族自治州,黔南布依族苗族自治州,曲靖市,庆阳市',
   r:'日照市,日喀则市',
   s:'石家庄市,朔州市,沈阳市,四平市,松原市,双鸭山市,绥化市,上海市,苏州市,宿迁市,绍兴市,宿州市,三明市,上饶市,三门峡市,商丘市,十堰市,随州市,邵阳市,韶关市,深圳市,汕头市,汕尾市,三亚市,三沙市,遂宁市,山南市,商洛市,石嘴山市',
   t:'天津市,唐山市,太原市,通辽市,铁岭市,通化市,泰州市,台州市,铜陵市,泰安市,铜仁市,铜川市,天水市,吐鲁番市,塔城地区',
  //  u:'',
  //  v:'',
   w:'乌海市,乌兰察布市,无锡市,温州市,芜湖市,潍坊市,威海市,武汉市,梧州市,文山壮族苗族自治州,渭南市,武威市,吴忠市,乌鲁木齐市',
   x:'邢台市,忻州市,兴安盟,锡林郭勒盟,徐州市,宣城市,厦门市,新余市,新乡市,许昌市,信阳市,襄阳市,孝感市,咸宁市,湘潭市,湘西土家族苗族自治州,西双版纳傣族自治州,西安市,咸阳市,西宁市',
   y:'阳泉市,运城市,营口市,延边朝鲜族自治州,伊春市,盐城市,扬州市,鹰潭市,宜春市,烟台市,宜昌市,岳阳市,益阳市,永州市,阳江市,云浮市,玉林市,宜宾市,雅安市,玉溪市,延安市,榆林市,玉树藏族自治州,银川市,伊犁哈萨克自治州',
   z:'张家口市,镇江市,舟山市,漳州市,淄博市,枣庄市,郑州市,周口市,驻马店市,株洲市,张家界市,珠海市,湛江市,肇庆市,中山市,重庆市,自贡市,资阳市,遵义市,昭通市,张掖市,中卫市,自治区直辖县级行政区划',
 }
 export const getCityData=(cityData)=>{
  let cityMap={};
  for(let k in citySource){
    citySource[k].split(',').forEach(item => {
      cityMap[item]=k.toUpperCase();
    });
  }
  let cityMapData={}
  if(cityData.length){
    cityData.forEach(ele=>{
      if(Array.isArray(cityMapData[cityMap[ele]])){
        cityMapData[cityMap[ele]]=[
          ...cityMapData[cityMap[ele]],
          ele
        ]
      }else{
        cityMapData[cityMap[ele]]=[ele]
      }
    })
  }
  return cityMapData;
 }